tests/cases/nuCorrelation/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam: injection molding solver modules
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Temperature: uniform 392 K (just above the solidification band), cold
    wall at 353 K, all other walls adiabatic.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    coldWall
    {
        type             moldingMoldTemperature;
        heatCapacity     5;        // [J/K] small lump so the response is fast
        coolant
        {
            massFlowRate     0.0001;   // [kg/s] low flow so the channel marches
            cp               4182;     // [J/kg/K]
            inletTemperature 350;      // [K]
            direction        (1 0 0);  // the patch has four faces along x
            // Nusselt correlation instead of a constant htc (task 044, gap G9:
// the Nu branch of moldingMoldTemperature was never configured by any
// case). C is chosen so that Nu*k/D = 5000 W/m^2/K exactly, i.e. the
// equivalent of the htc the sibling coolantChannel case uses
            Nu
            {
                C            8.333333333;
                m            1;
                n            1;
                Re           1;
                Pr           1;
                k            0.6;
                D            1e-3;
            }
        }
        T                300;      // [K] initial mould temperature
        value            uniform 300;
    }

    hotEnd
    {
        type            zeroGradient;
    }

    sides
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
