tests/cases/nuCorrelation/system/expectedPatterns
# The Nusselt-correlated coolant BC must keep the channel march stable
End
