tests/cases/nuCorrelation/system/verifyScript
verify-nu-correlation.py
